CDE-CIP-TNDISPATCHER-0700-main/deployment/nft/load-test-vaultOps.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.9" jmeter="3.0 r1743807">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TnDispatcher" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${loopCount}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${users}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">{$rampUp}</stringProp>
        <longProp name="ThreadGroup.start_time">1468423835000</longProp>
        <longProp name="ThreadGroup.end_time">1468423835000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">360</stringProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="tndispatcherIP" elementType="Argument">
              <stringProp name="Argument.name">tndispatcherIP</stringProp>
              <stringProp name="Argument.value">${__P(tndispatcherIP,xxx)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="users" elementType="Argument">
              <stringProp name="Argument.name">users</stringProp>
              <stringProp name="Argument.value">${__P(users,1)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="rampUp" elementType="Argument">
              <stringProp name="Argument.name">rampUp</stringProp>
              <stringProp name="Argument.value">${__P(rampUp,5)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="loopCount" elementType="Argument">
              <stringProp name="Argument.name">loopCount</stringProp>
              <stringProp name="Argument.value">${__P(loopCount,1)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/xml</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">text/xml</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="vaultBasics" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="message id counter" enabled="true">
            <stringProp name="CounterConfig.start">1000000</stringProp>
            <stringProp name="CounterConfig.end">2000000</stringProp>
            <stringProp name="CounterConfig.incr">4</stringProp>
            <stringProp name="CounterConfig.name">MSG_ID</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
          </CounterConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/dispatch tokenize" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:urn=&quot;urn:schemas-cybersource-com:transaction-data-2.3&quot;&gt;&#xd;
&lt;soapenv:Header&gt;&#xd;
 &lt;wsse:Security&#xd;
            xmlns:wsse=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd&quot;&#xd;
            soapenv:mustUnderstand=&quot;1&quot;&gt;&#xd;
  &lt;wsse:UsernameToken&#xd;
                xmlns:wsu=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd&quot;&#xd;
                wsu:Id=&quot;UsernameToken-1&quot;&gt;&#xd;
  &lt;wsse:Username&gt;username&lt;/wsse:Username&gt;&#xd;
   &lt;wsse:Password&#xd;
                    Type=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText&quot;&gt;password&lt;/wsse:Password&gt;&#xd;
  &lt;/wsse:UsernameToken&gt;&#xd;
 &lt;/wsse:Security&gt;&#xd;
&lt;/soapenv:Header&gt;&#xd;
&lt;soapenv:Body&gt;&#xd;
&lt;urn:requestMessages&gt;&#xd;
         &lt;requestMessage&gt;&#xd;
            &lt;srcSystem&gt;&#xd;
               &lt;name&gt;CybSrcSanityTest&lt;/name&gt;&#xd;
               &lt;messageId&gt;${MSG_ID}&lt;/messageId&gt;&#xd;
               &lt;sysIndicator&gt;735701&lt;/sysIndicator&gt;&#xd;
            &lt;/srcSystem&gt;&#xd;
            &lt;card&gt;&#xd;
               &lt;token&gt;9668475942450001&lt;/token&gt;&#xd;
            &lt;/card&gt;&#xd;
            &lt;ccFirstSixService run=&quot;true&quot;/&gt;&#xd;
         &lt;/requestMessage&gt;&#xd;
&lt;/urn:requestMessages&gt;&#xd;
&lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${tndispatcherIP}</stringProp>
            <stringProp name="HTTPSampler.port">7050</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/dispatch</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/dispatch verify" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:urn=&quot;urn:schemas-cybersource-com:transaction-data-2.3&quot;&gt;&#xd;
&lt;soapenv:Header&gt;&#xd;
 &lt;wsse:Security&#xd;
            xmlns:wsse=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd&quot;&#xd;
            soapenv:mustUnderstand=&quot;1&quot;&gt;&#xd;
  &lt;wsse:UsernameToken&#xd;
                xmlns:wsu=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd&quot;&#xd;
                wsu:Id=&quot;UsernameToken-1&quot;&gt;&#xd;
  &lt;wsse:Username&gt;username&lt;/wsse:Username&gt;&#xd;
   &lt;wsse:Password&#xd;
                    Type=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText&quot;&gt;password&lt;/wsse:Password&gt;&#xd;
  &lt;/wsse:UsernameToken&gt;&#xd;
 &lt;/wsse:Security&gt;&#xd;
&lt;/soapenv:Header&gt;&#xd;
&lt;soapenv:Body&gt;&#xd;
&lt;urn:requestMessages&gt;&#xd;
         &lt;requestMessage&gt;&#xd;
            &lt;srcSystem&gt;&#xd;
               &lt;name&gt;CybSrcSanityTest&lt;/name&gt;&#xd;
               &lt;messageId&gt;${MSG_ID}&lt;/messageId&gt;&#xd;
               &lt;sysIndicator&gt;735701&lt;/sysIndicator&gt;&#xd;
            &lt;/srcSystem&gt;&#xd;
            &lt;card&gt;&#xd;
               &lt;token&gt;9668475942450001&lt;/token&gt;&#xd;
            &lt;/card&gt;&#xd;
            &lt;ccVerifyService run=&quot;true&quot;/&gt;&#xd;
         &lt;/requestMessage&gt;&#xd;
&lt;/urn:requestMessages&gt;&#xd;
&lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${tndispatcherIP}</stringProp>
            <stringProp name="HTTPSampler.port">7050</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/dispatch</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/dispatch firstSix" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:urn=&quot;urn:schemas-cybersource-com:transaction-data-2.3&quot;&gt;&#xd;
&lt;soapenv:Header&gt;&#xd;
 &lt;wsse:Security&#xd;
            xmlns:wsse=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd&quot;&#xd;
            soapenv:mustUnderstand=&quot;1&quot;&gt;&#xd;
  &lt;wsse:UsernameToken&#xd;
                xmlns:wsu=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd&quot;&#xd;
                wsu:Id=&quot;UsernameToken-1&quot;&gt;&#xd;
  &lt;wsse:Username&gt;username&lt;/wsse:Username&gt;&#xd;
   &lt;wsse:Password&#xd;
                    Type=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText&quot;&gt;password&lt;/wsse:Password&gt;&#xd;
  &lt;/wsse:UsernameToken&gt;&#xd;
 &lt;/wsse:Security&gt;&#xd;
&lt;/soapenv:Header&gt;&#xd;
&lt;soapenv:Body&gt;&#xd;
&lt;urn:requestMessages&gt;&#xd;
         &lt;requestMessage&gt;&#xd;
            &lt;srcSystem&gt;&#xd;
               &lt;name&gt;CybSrcSanityTest&lt;/name&gt;&#xd;
               &lt;messageId&gt;${MSG_ID}&lt;/messageId&gt;&#xd;
               &lt;sysIndicator&gt;735701&lt;/sysIndicator&gt;&#xd;
            &lt;/srcSystem&gt;&#xd;
            &lt;card&gt;&#xd;
               &lt;token&gt;9668475942450016&lt;/token&gt;&#xd;
            &lt;/card&gt;&#xd;
            &lt;user&gt;&#xd;
               &lt;userName&gt;testUserSiva&lt;/userName&gt;&#xd;
               &lt;userId&gt;TUS1234&lt;/userId&gt;&#xd;
            &lt;/user&gt;&#xd;
            &lt;ccFirstSixService run=&quot;true&quot;/&gt;&#xd;
         &lt;/requestMessage&gt;&#xd;
&lt;/urn:requestMessages&gt;&#xd;
&lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;&#xd;
&#xd;
&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${tndispatcherIP}</stringProp>
            <stringProp name="HTTPSampler.port">7050</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/dispatch</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/dispatch detokenize" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:urn=&quot;urn:schemas-cybersource-com:transaction-data-2.3&quot;&gt;&#xd;
&lt;soapenv:Header&gt;&#xd;
 &lt;wsse:Security&#xd;
            xmlns:wsse=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd&quot;&#xd;
            soapenv:mustUnderstand=&quot;1&quot;&gt;&#xd;
  &lt;wsse:UsernameToken&#xd;
                xmlns:wsu=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd&quot;&#xd;
                wsu:Id=&quot;UsernameToken-1&quot;&gt;&#xd;
  &lt;wsse:Username&gt;username&lt;/wsse:Username&gt;&#xd;
   &lt;wsse:Password&#xd;
                    Type=&quot;http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText&quot;&gt;password&lt;/wsse:Password&gt;&#xd;
  &lt;/wsse:UsernameToken&gt;&#xd;
 &lt;/wsse:Security&gt;&#xd;
&lt;/soapenv:Header&gt;&#xd;
&lt;soapenv:Body&gt;&#xd;
&lt;urn:requestMessages&gt;&#xd;
         &lt;requestMessage&gt;&#xd;
            &lt;srcSystem&gt;&#xd;
               &lt;name&gt;CybSrcSanityTest&lt;/name&gt;&#xd;
               &lt;messageId&gt;${MSG_ID}&lt;/messageId&gt;&#xd;
               &lt;sysIndicator&gt;735701&lt;/sysIndicator&gt;&#xd;
            &lt;/srcSystem&gt;&#xd;
            &lt;card&gt;&#xd;
               &lt;token&gt;9668475942450012&lt;/token&gt;&#xd;
            &lt;/card&gt;&#xd;
            &lt;user&gt;&#xd;
               &lt;userName&gt;testUserSiva&lt;/userName&gt;&#xd;
               &lt;userId&gt;TUS1234&lt;/userId&gt;&#xd;
            &lt;/user&gt;&#xd;
            &lt;ccDeTokenizeService run=&quot;true&quot;/&gt;&#xd;
         &lt;/requestMessage&gt;&#xd;
&lt;/urn:requestMessages&gt;&#xd;
&lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;&#xd;
&#xd;
&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${tndispatcherIP}</stringProp>
            <stringProp name="HTTPSampler.port">7050</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/dispatch</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
        <intProp name="calcMode">4</intProp>
        <doubleProp>
          <name>throughput</name>
          <value>18000.0</value>
          <savedValue>0.0</savedValue>
        </doubleProp>
      </ConstantThroughputTimer>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>